# Homebrew Bundle File
# This file contains commands and taps for managing applications and dependencies using Homebrew.
#
# Usage:
#   - Run `cd $ZSH; brew bundle ...` to execute any command.
#   - Use `brew bundle check` to verify that all required formulae and casks are installed.
#   - To remove all formulae and casks not specified in this file, run `brew bundle cleanup`.
#   - To install everything listed in the file, use `brew bundle`.

# Configuration
cask_args appdir: '/Applications'

# Taps for additional repositories
tap 'homebrew/bundle'       # Homebrew Bundle for managing formulae and casks
# tap 'homebrew/cask-fonts'   # Font management is now integrated into Homebrew core, not in a separate tap
tap 'homebrew/cask'         # Additional casks for installation

# Fonts
brew 'font-jetbrains-mono-nerd-font'
brew 'font-meslo-lg-nerd-font'
brew 'font-hack-nerd-font'

# Utilities and Development Tools
brew 'ack'              # Code search tool
brew 'cheat'            # Command-line cheat sheets
brew 'coreutils'        # GNU utilities for Unix-like operating systems
brew 'grc'              # Generic colorizer
brew 'libgit2'          # Git bindings for various programming languages
brew 'openssl'          # Encryption and security utilities
brew 'python'           # Core dependency for installing nodeenv
brew 'readline'         # Terminal output editing capabilities
brew 'reattach-to-user-namespace'  # Fix OS X issue with tmux exiting after startup
brew 'spaceman-diff'    # Display images in Git diffs
brew 'tmux'             # Enhanced terminal multiplexer
brew 'trash'            # Command for moving files to the Trash on OS X
brew 'wget'             # Network utility for downloading files from the web
brew 'fnm'              # Node version manager
brew 'groovy'           # Groovy programming language support
brew 'awscli'
brew 'saml2aws'         # AWS CLI from SAML, useful for accessing AWS resources via SAML
brew 'gnu-sed'
brew 'tree'
brew 'gmake'

# Development Tools
brew 'neovim'
brew 'ripgrep'

# Casks (Graphical User Interfaces)
cask 'miniconda'        # Python environment management
cask 'poetry'           # Dependency and packaging tool for Python applications

# Raspberry Pi related casks (commented out)
# cask 'ext4fuse'         # Not needed, build from source if required
# cask 'macfuse'          # Provides the required components for FUSE

# Firefox and Google Chrome (commented out)
# cask 'firefox'
# cask 'google-chrome'

# HandBrake, Seashore, Slack, Steam, Transmission, TunnelBear, VLC, ChefDK (commented out)
# cask 'handbrake'
# cask 'seashore'
# cask 'slack'
# cask 'steam'
# cask 'transmission'
# cask 'tunnelbear'
# cask 'vlc'
# cask 'chefdk'

# Additional Fonts and Tools (commented out)
# brew 'font-menlo-for-powerline'
# brew 'xquartz'
