# Homebrew Bundle File
# This file contains commands and taps for managing applications and dependencies using Homebrew.
#
# Usage:
#   - Run `cd $ZSH; brew bundle ...` to execute any command.
#   - Use `brew bundle check` to verify that all required formulae and casks are installed.
#   - To remove all formulae and casks not specified in this file, run `brew bundle cleanup`.
#   - To install everything listed in the file, use `brew bundle`.

# Configuration
cask_args appdir: '/Applications'

# Taps for additional repositories
tap 'homebrew/bundle'       # Homebrew Bundle for managing formulae and casks
tap 'derailed/k9s'          # k9s
tap 'git-chglog/git-chglog' # git-chglog
tap 'hashicorp/tap'         # packer, terraform
tap 'nilukush/ytt'          # youtube-transcript-tools
tap 'qmk/qmk'               # qmk
tap 'sst/tap'               # opencode
# tap 'homebrew/cask-fonts'   # Font management is now integrated into Homebrew core, not in a separate tap
tap 'marcus/tap'
tap 'AlexsJones/llmfit'     # llmfit
tap 'charmbracelet/tap'     # tui based git repo host
tap 'specstoryai/tap'

# Fonts
cask 'font-jetbrains-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-hack-nerd-font'

# Other casks
cask 'claude-code'

# Utilities and Development Tools
brew 'ack'              # Code search tool
# brew 'atlassian/homebrew-acli/acli'
brew 'argo'
brew 'asdf'
brew 'awscli'
brew 'black'
brew 'btop'
brew 'charmbracelet/tap/soft-serve'
brew 'cheat'            # Command-line cheat sheets
brew 'cmake'
brew 'coreutils'        # GNU utilities for Unix-like operating systems
brew 'duckdb'
brew 'ffmpeg'
brew 'fmt'              # Simplifying and optimizing text files
brew 'fnm'              # Node version manager
brew 'gh'
brew 'git-chglog/git-chglog/git-chglog'
brew 'go'
brew 'go-parquet-tools'
brew 'gnupg'
brew 'grc'              # Generic colorizer
brew 'groovy'           # Groovy programming language support
brew 'helm'
brew 'jira-cli'
brew 'jj'
brew 'kubectx'
brew 'kustomize'
brew 'lazygit'
brew 'libgit2'          # Git bindings for various programming languages
brew 'librist'
brew 'llmfit'
brew 'marcus/tap/sidecar' # Agentic workflow optics
brew 'marcus/tap/td'      # Agentic task tracking (sidecar)
brew 'marp-cli'           # Markdown to HTML/PDF/PPT slides
brew 'minio'
brew 'make'
brew 'minio-mc'
brew 'neovim'
brew 'nilukush/ytt/youtube-transcript-tools'
brew 'openconnect'
brew 'openvino'
brew 'pipx'
brew 'pkgconf'
brew 'poetry'
brew 'postgresql@14'
brew 'pre-commit'
brew 'python@3.10', link: false
brew 'python@3.12', link: true
brew 'qmk/qmk/qmk'
brew 'reattach-to-user-namespace'  # Fix OS X issue with tmux exiting after startup
brew 'saml2aws'         # AWS CLI from SAML, useful for accessing AWS resources via SAML
brew 'skaffold'
brew 'specstoryai/tap/specstory' # wrap agent CLI to save prompts
brew 'spaceman-diff'    # Display images in Git diffs
brew 'sqlfluff'
brew 'sqruff'
brew 'sst/tap/opencode'
brew 'rustup'
brew 'gromgit/brewtils/taproom'
brew 'tmux'             # Enhanced terminal multiplexer
brew 'trash'            # Command for moving files to the Trash on OS X
brew 'tree'
brew 'uv'
brew 'vhs'              # Terminal demos https://github.com/charmbracelet/vhs
brew 'watch'
brew 'wget'             # Network utility for downloading files from the web
brew 'yamllint'
brew 'yt-dlp'

# Casks (Graphical User Interfaces)
# cask 'miniconda'        # Python environment management
cask 'alacritty'

cask 'ghostty'
cask 'gimp'
cask 'hiddenbar'
cask 'hot'
# cask 'macfuse'
cask 'macs-fan-control'
cask 'qmk-toolbox'
cask 'snowflake-snowsql'
cask 'via'

# Raspberry Pi related casks (commented out)
# cask 'ext4fuse'         # Not needed, build from source if required
# cask 'macfuse'          # Provides the required components for FUSE

# Firefox and Google Chrome (commented out)
# cask 'firefox'
# cask 'google-chrome'

# HandBrake, Seashore, Slack, Steam, Transmission, TunnelBear, VLC, ChefDK (commented out)
# cask 'handbrake'
# cask 'seashore'
# cask 'slack'
# cask 'steam'
# cask 'transmission'
# cask 'tunnelbear'
# cask 'vlc'
# cask 'chefdk'

# Additional Fonts and Tools (commented out)
# brew 'font-menlo-for-powerline'
# brew 'xquartz'
brew "terraform"
